{
  "competition": "China National Olympiad (CMO)",
  "years": [
    {
      "year": 2016,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , a31; b1, b2, $\\cdot$ $\\cdot$ $\\cdot$ , b31 be positive integers such that a1 < a2 < $\\cdot$ $\\cdot$ $\\cdot$ < a31 $\\leq$2015 , b1 < b2 < $\\cdot$ $\\cdot$ $\\cdot$ < b31 $\\leq$2015 and a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + a31 = b1 + b2 + $\\cdot$ $\\cdot$ $\\cdot$ + b31. Find the maximum value of S = $|$a1 −b1$|$ + $|$a2 −b2$|$ + $\\cdot$ $\\cdot$ $\\cdot$ + $|$a31 −b31$|$."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "In $\\triangle$AEF, let B and D be on segments AE and AF respectively, and let ED and FB intersect at C. Deﬁne K, L, M, N on segments AB, BC, CD, DA such that AK KB = AD BC and its cyclic equivalents. Let the incircle of $\\triangle$AEF touch AE, AF at S, T respectively; let the incircle of $\\triangle$CEF touch CE, CF at U, V respectively. Prove that K, L, M, N concyclic implies S, T, U, V concyclic."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let p be an odd prime and a1, a2, ..., ap be integers. Prove that the following two conditions are equivalent: 1) There exists a polynomial P(x) with degree $\\leq$p−1"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "such that P(i) $\\equiv$ai (mod p) for all 1 $\\leq$ i $\\leq$p 2) For any natural d $\\leq$p−1 2 , p X i=1 (ai+d −ai)2 $\\equiv$0 (mod p) where indices are taken (mod p)"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Let n $\\geq$2 be a positive integer and deﬁne k to be the number of primes $\\leq$n. Let A be a subset of S = {2, ..., n} such that $|$A$|$ $\\leq$k and no two elements in A divide each other. Show that one can ﬁnd a set B such that $|$B$|$ = k, A $\\subseteq$B $\\subseteq$S and no two elements in B divide each other."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Let ABCD be a convex quadrilateral. Show that there exists a square A′B′C′D′ (Vertices maybe ordered clockwise or counter-clockwise) such that A = A′, B = B′, C = C′, D = D′ and AA′, BB′, CC′, DD′ are all concurrent."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let G be a complete directed graph with 100 vertices such that for any two vertices x, y one can ﬁnd a directed path from x to y. a) Show that for any such G, one can ﬁnd a m such that for any two vertices x, y one can ﬁnd a directed path of length m from x to y (Vertices can be repeated in the path) © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2016 China National Olympiad b) For any graph G with the properties above, deﬁne m(G) to be smallest possible m as deﬁned in part a). Find the minimim value of m(G) over all such possible G’s. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2019 China National Olympiad 2019 China National Olympiad www.artofproblemsolving.com/community/c789151 by lifeisgood03, sqing, mofumofu, 61plus –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Let a, b, c, d, e $\\geq$−1 and a + b + c + d + e = 5. Find the maximum and minimum value of S = (a + b)(b + c)(c + d)(d + e)(e + a)."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Call a set of 3 positive integers {a, b, c} a Pythagorean set if a, b, c are the lengths of the 3 sides of a right-angled triangle. Prove that for any 2 Pythagorean sets P, Q, there exists a positive integer m $\\geq$2 and Pythagorean sets P1, P2, . . . , Pm such that P = P1, Q = Pm, and $\\forall$1 $\\leq$i $\\leq$m −1, Pi $\\cap$Pi+1 = $\\emptyset$."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let O be the circumcenter of $\\triangle$ABC(AB < AC), and D be a point on the internal angle bi- sector of $\\angle$BAC. Point E lies on BC, satisfying OE $\\parallel$AD, DE $\\perp$BC. Point K lies on EB extended such that EK = EA. The circumcircle of $\\triangle$ADK meets BC at P = K, and meets the circumcircle of $\\triangle$ABC at Q = A. Prove that PQ is tangent to the circumcircle of $\\triangle$ABC. –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Given an ellipse that is not a circle. (1) Prove that the rhombus tangent to the ellipse at all four of its sides with minimum area is unique. (2) Construct this rhombus using a compass and a straight edge."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Given is an n $\\times$ n board, with an integer written in each grid. For each move, I can choose any grid, and add 1 to all 2n −1 numbers in its row and column. Find the largest N(n), such that for any initial choice of integers, I can make a ﬁnite number of moves so that there are at least N(n) even numbers on the board."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "The point P1, P2, $\\cdot$ $\\cdot$ $\\cdot$ , P2018 is placed inside or on the boundary of a given regular pentagon. Find all placement methods are made so that S = X 1$\\leq$i<j$\\leq$2018 $|$PiPj$|$2 takes the maximum value. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2020 China National Olympiad 2020 China National Olympiad www.artofproblemsolving.com/community/c1018560 by Henry 2001, WypHxr, mofumofu"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , a41 $\\in$R, such that a41 = a1, P40 i=1 ai = 0, and for any i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , 40, $|$ai−ai+1$|$ $\\leq$ 1. Determine the greatest possible value of (1)a10 + a20 + a30 + a40; (2)a10 $\\cdot$ a20 + a30 $\\cdot$ a40."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "In triangle ABC, AB > AC. The bisector of $\\angle$BAC meets BC at D. P is on line DA, such that A lies between P and D. PQ is tangent to $\\odot$(ABD) at Q. PR is tangent to $\\odot$(ACD) at R. CQ meets BR at K. The line parallel to BC and passing through K meets QD, AD, RD at E, L, F, respectively. Prove that EL = KF."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let S be a set, $|$S$|$ = 35. A set F of mappings from S to itself is called to be satisfying prop- erty P(k), if for any x, y $\\in$S, there exist f1, $\\cdot$ $\\cdot$ $\\cdot$ , fk $\\in$F (not necessarily different), such that fk(fk−1($\\cdot$ $\\cdot$ $\\cdot$ (f1(x)))) = fk(fk−1($\\cdot$ $\\cdot$ $\\cdot$ (f1(y)))). Find the least positive integer m, such that if F satisﬁes property P(2019), then it also satisﬁes property P(m)."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Find the largest positive constant C such that the following is satisﬁed: Given n arcs (contain- ing their endpoints) A1, A2, . . . , An on the circumference of a circle, where among all sets of three arcs (Ai, Aj, Ak) (1 $\\leq$i < j < k $\\leq$n), at least half of them has Ai$\\cap$Aj$\\cap$Ak nonempty, then there exists l > Cn, such that we can choose l arcs among A1, A2, . . . , An, whose intersection is nonempty."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Given any positive integer c, denote p(c) as the largest prime factor of c. A sequence {an} of positive integers satisﬁes a1 > 1 and an+1 = an + p(an) for all n $\\geq$1. Prove that there must exist at least one perfect square in sequence {an}."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Does there exist positive reals a0, a1, . . . , a19, such that the polynomial P(x) = x20 + a19x19 + . . . + a1x + a0 does not have any real roots, yet all polynomials formed from swapping any two coefﬁcients ai, aj has at least one real root? © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2021 China National Olympiad 2021 China National Olympiad www.artofproblemsolving.com/community/c1617667 by Tintarn, Rickyminer, mofumofu, sqing, SpecialBeing2017, NTssu –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Let {zn}n$\\geq$1 be a sequence of complex numbers, whose odd terms are real, even terms are purely imaginary, and for every positive integer k, $|$zkzk+1$|$ = 2k. Denote fn = $|$z1 +z2 +$\\cdot$ $\\cdot$ $\\cdot$+zn$|$, for n = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ (1) Find the minimum of f2020. (2) Find the minimum of f2020 $\\cdot$ f2021."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let m > 1 be an integer. Find the smallest positive integer n, such that for any integers a1, a2, . . . , an; b1, b2, . . . , bn there exists integers x1, x2, . . . , xn satisfying the following two con- ditions: i) There exists i $\\in${1, 2, . . . , n} such that xi and m are coprime ii) Pn i=1 aixi $\\equiv$Pn i=1 bixi $\\equiv$0 (mod m)"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let n be positive integer such that there are exactly 36 different prime numbers that divides n. For k = 1, 2, 3, 4, 5, cn be the number of integers that are mutually prime numbers to n in the interval [(k−1)n"
        },
        {
          "day": 1,
          "number": 5,
          "problem": ", kn 5 ]. c1, c2, c3, c4, c5 is not exactly the same.Prove that X 1$\\leq$i<j$\\leq$5 (ci −cj)2 $\\geq$236. –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "In acute triangle ABC(AB > AC), M is the midpoint of minor arc BC, O is the circumcenter of (ABC) and AK is its diameter. The line parallel to AM through O meets segment AB at D, and CA extended at E. Lines BM and CK meet at P, lines BK and CM meet at Q. Prove that $\\angle$OPB + $\\angle$OEB = $\\angle$OQC + $\\angle$ODC."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "P is a convex polyhedron such that: (1) every vertex belongs to exactly 3 faces. (1) For every natural number n, there are even number of faces with n vertices. An ant walks along the edges of P and forms a non-self-intersecting cycle, which divides the faces of this polyhedron into two sides, such that for every natural number n, the number of faces with n vertices on each side are the same. (assume this is possible) © 2021 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2021 China National Olympiad Show that the number of times the ant turns left is the same as the number of times the ant turn right."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Find f : Z+ $\\rightarrow$Z+, such that for any x, y $\\in$Z+, f(f(x) + y) $|$ x + f(y). © 2021 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2022 China National Olympiad China National Olympiad 22 www.artofproblemsolving.com/community/c2742261 by parmenides51, mofumofu –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Let a and b be two positive real numbers, and AB a segment of length a on a plane. Let C, D be two variable points on the plane such that ABCD is a non-degenerate convex quadrilateral with BC = CD = b and DA = a. It is easy to see that there is a circle tangent to all four sides of the quadrilateral ABCD. Find the precise locus of the point I."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Find the largest real number $\\lambda$ with the following property: for any positive real numbers p, q, r, s there exists a complex number z = a + bi(a, b $\\in$R) such that $|$b$|$ $\\geq$$\\lambda$$|$a$|$ and (pz3 + 2qz2 + 2rz + s) $\\cdot$ (qz3 + 2pz2 + 2sz + r) = 0."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Find all positive integers a such that there exists a set X of 6 integers satisfying the following conditions: for every k = 1, 2, . . . , 36 there exist x, y $\\in$X such that ax + y −k is divisible by 37. –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "A conference is attended by n(n $\\geq$3) scientists. Each scientist has some friends in this confer- ence (friendship is mutual and no one is a friend of him/herself). Suppose that no matter how we partition the scientists into two nonempty groups, there always exist two scientists in the same group who are friends, and there always exist two scientists in different groups who are friends. A proposal is introduced on the ﬁrst day of the conference. Each of the scientists’ opinion on the proposal can be expressed as a non-negative integer. Everyday from the second day onwards, each scientists’ opinion is changed to the integer part of the average of his/her friends’ opinions from the previous day. Prove that after a period of time, all scientists have the same opinion on the proposal."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "On a blank piece of paper, two points with distance 1 is given. Prove that one can use (only) straightedge and compass to construct on this paper a straight line, and two points on it whose distance is $\\sqrt{}$ 2021 such that, in the process of constructing it, the total number of circles or straight lines drawn is at most 10. Remark: Explicit steps of the construction should be given. Label the circles and straight lines © 2021 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2022 China National Olympiad in the order that they appear. Partial credit may be awarded depending on the total number of circles/lines."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "For integers 0 $\\leq$a $\\leq$n, let f(n, a) denote the number of coefﬁcients in the expansion of (x + 1)a(x + 2)n−a that is divisible by 3. For example, (x + 1)3(x + 2)1 = x4 + 5x3 + 9x2 + 7x + 2, so f(4, 3) = 1. For each positive integer n, let F(n) be the minimum of f(n, 0), f(n, 1), . . . , f(n, n). (1) Prove that there exist inﬁnitely many positive integer n such that F(n) $\\geq$n−1 3 . (2) Prove that for any positive integer n, F(n) $\\leq$n−1 3 . © 2021 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2023 China National Olympiad 2023 China National Olympiad www.artofproblemsolving.com/community/c3238312 by CHN Lucas, JG666, CANBANKAN, David-Vieta –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Deﬁne the sequences (an), (bn) by an, bn > 0, $\\forall$n $\\in$N+ an+1 = an −"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "1 + Pn i=1"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "ai bn+1 = bn +"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "1 + Pn i=1"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "bi 1) If a100b100 = a101b101, ﬁnd the value of a1 −b1; 2) If a100 = b99, determine which is larger between a100 + b100 and a101 + b101."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let $\\triangle$ABC be an equilateral triangle of side length 1. Let D, E, F be points on BC, AC, AB respectively, such that DE 20 = EF 22 = FD 38 . Let X, Y, Z be on lines BC, CA, AB respectively, such that XY $\\perp$DE, Y Z $\\perp$EF, ZX $\\perp$FD. Find all possible values of"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "[DEF] +"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "[XY Z]."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given positive integer m, n, color the points of the regular (2m + 2n)-gon in black and white, 2m in black and 2n in white. The coloring distance d(B, C) of two black points B, C is deﬁned as the smaller number of white points in the two paths linking the two black points. The coloring distance d(W, X) of two white points W, X is deﬁned as the smaller number of black points in the two paths linking the two white points. We deﬁne the matching of black points B : label the 2m black points with A1, $\\cdot$ $\\cdot$ $\\cdot$ , Am, B1, $\\cdot$ $\\cdot$ $\\cdot$ , Bm satisfying no AiBi intersects inside the gon. We deﬁne the matching of white points W : label the 2n white points with C1, $\\cdot$ $\\cdot$ $\\cdot$ , Cn, D1, $\\cdot$ $\\cdot$ $\\cdot$ , Dn satisfying no CiDi intersects inside the gon. We deﬁne P(B) = Pm i=1 d(Ai, Bi), P(W) = Pn j=1 d(Cj, Dj). Prove that: maxB P(B) = maxW P(W) –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Find the minimum positive integer n $\\geq$3, such that there exist n points A1, A2, $\\cdot$ $\\cdot$ $\\cdot$ , An satisfying no three points are collinear and for any 1 $\\leq$i $\\leq$n, there exist 1 $\\leq$j $\\leq$n(j = i), segment AjAj+1 pass through the midpoint of segment AiAi+1, where An+1 = A1 © 2023 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2023 China National Olympiad"
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Prove that there exist C > 0, which satisﬁes the following conclusion: For any inﬁnite positive arithmetic integer sequence a1, a2, a3, $\\cdot$ $\\cdot$ $\\cdot$ , if the greatest common divi- sor of a1 and a2 is squarefree, then there exists a positive integer m $\\leq$C $\\cdot$ a22, such that am is squarefree. Note: A positive integer N is squarefree if it is not divisible by any square number greater than 1. Proposed by Qu Zhenhua"
        },
        {
          "day": 2,
          "number": 6,
          "problem": "There are n(n $\\geq$8) airports, some of which have one-way direct routes between them. For any two airports a and b, there is at most one one-way direct route from a to b (there may be both one-way direct routes from a to b and from b to a). For any set A composed of airports (1 $\\leq$$|$A$|$ $\\leq$n −1), there are at least 4 $\\cdot$ min{$|$A$|$, n −$|$A$|$} one-way direct routes from the airport in A to the airport not in A. Prove that: For any airport x, we can start from x and return to the airport by no more than $\\sqrt{}$ 2n one-way direct routes. © 2023 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2024 China National Olympiad 2024 China National Olympiad www.artofproblemsolving.com/community/c3631007 by Photaesthesia, sqing, LoloChen –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Find the smallest $\\lambda$ $\\in$R such that for all n $\\in$N+, there exists x1, x2, . . . , xn satisfying n = x1x2 . . . x2023, where xi is either a prime or a positive integer not exceeding n$\\lambda$ for all i $\\in${1, 2, . . . , 2023}. Proposed by Yinghua Ai"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Find the largest real number c such that n X i=1 n X j=1 (n −$|$i −j$|$)xixj $\\geq$c n X j=1 x2 i for any positive integer n and any real numbers x1, x2, . . . , xn."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let p ⩾5 be a prime and S = {1, 2, . . . , p}. Deﬁne r(x, y) as follows: r(x, y) = ( y −x y ⩾x y −x + p y < x . For a nonempty proper subset A of S, let f(A) = X x$\\in$A X y$\\in$A (r(x, y))2 . A good subset of S is a nonempty proper subset A satisfying that for all subsets B $\\subseteq$S of the same size as A, f(B) ⩾f(A). Find the largest integer L such that there exists distinct good subsets A1 $\\subseteq$A2 $\\subseteq$. . . $\\subseteq$AL. Proposed by Bin Wang –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Let a1, a2, . . . , a2023 be nonnegative real numbers such that a1 + a2 + . . . + a2023 = 100. Let A = {(i, j) $|$ 1 ⩽i ⩽j ⩽2023, aiaj ⩾1}. Prove that $|$A$|$ ⩽5050 and determine when the equality holds. Proposed by Yunhao Fu © 2024 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2024 China National Olympiad"
        },
        {
          "day": 2,
          "number": 5,
          "problem": "In acute $\\triangle$ABC, K is on the extention of segment BC. P, Q are two points such that KP $\\parallel$ AB, BK = BP and KQ $\\parallel$AC, CK = CQ. The circumcircle of $\\triangle$KPQ intersects AK again at T. Prove that: (1) $\\angle$BTC + $\\angle$APB = $\\angle$CQA. (2) AP $\\cdot$ BT $\\cdot$ CQ = AQ $\\cdot$ CT $\\cdot$ BP. Proposed by Yijie He and Yijuan Yao"
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let P be a regular 99-gon. Assign integers between 1 and 99 to the vertices of P such that each integer appears exactly once. (If two assignments coincide under rotation, treat them as the same. ) An operation is a swap of the integers assigned to a pair of adjacent vertices of P. Find the smallest integer n such that one can achieve every other assignment from a given one with no more than n operations. Proposed by Zhenhua Qu © 2024 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2025 China National Olympiad 2025 China National Olympiad www.artofproblemsolving.com/community/c4110027 by Photaesthesia –"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "Let $\\alpha$ > 1 be an irrational number and L be a integer such that L > $\\alpha$2 $\\alpha$−1. A sequence x1, x2, $\\cdot$ $\\cdot$ $\\cdot$ satisﬁes that x1 > L and for all positive integers n, xn+1 = ( $\\lfloor$$\\alpha$xn$\\rfloor$ if xn ⩽L \u0004 xn $\\alpha$ \u0005 if xn > L . Prove that (i) {xn} is eventually periodic. (ii) The eventual fundamental period of {xn} is an odd integer which doesn’t depend on the choice of x1."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let ABC be a triangle with incenter I. Denote the midpoints of AI, AC and CI by L, M and N respectively. Point D lies on segment AM such that BC = BD. Let the incircle of triangle ABD be tangent to AD and BD at E and F respectively. Denote the circumcenter of triangle AIC by J, and the circumcircle of triangle JMD by $\\omega$. Lines MN and JL meet $\\omega$ again at P and Q respectively. Prove that PQ, LN and EF are concurrent."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let a1, a2, . . . , an be integers such that a1 > a2 > $\\cdot$ $\\cdot$ $\\cdot$ > an > 1. Let M = lcm (a1, a2, . . . , an). For any ﬁnite nonempty set X of positive integers, deﬁne f(X) = min 1⩽i⩽n X x$\\in$X \u001a x ai \u001b . Such a set X is called minimal if for every proper subset Y of it, f(Y ) < f(X) always holds. Suppose X is minimal and f(X) ⩾"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "an . Prove that $|$X$|$ ⩽f(X) $\\cdot$ M. –"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "The fractional distance between two points (x1, y1) and (x2, y2) is deﬁned as q $\\parallel$x1 −x2$\\parallel$2 + $\\parallel$y1 −y2$\\parallel$2, © 2024 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2025 China National Olympiad where $\\parallel$x$\\parallel$denotes the distance between x and its nearest integer. Find the largest real r such that there exists four points on the plane whose pairwise fractional distance are all at least r."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Let p be a prime number and f be a bijection from {0, 1, . . . , p −1} to itself. Suppose that for integers a, b $\\in${0, 1, . . . , p −1}, $|$f(a) −f(b)$|$ ⩽2024 if p $|$ a2 −b. Prove that there exists inﬁnite many p such that there exists such an f and there also exists inﬁnite many p such that there doesn’t exist such an f."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let a1, a2, . . . , an be real numbers such that Pn i=1 ai = n, Pn i=1 a2 i = 2n, Pn i=1 a3 i = 3n. (i) Find the largest constant C, such that for all n ⩾4, max {a1, a2, . . . , an} −min {a1, a2, . . . , an} ⩾C. (ii) Prove that there exists a positive constant C2, such that max {a1, a2, . . . , an} −min {a1, a2, . . . , an} ⩾C + C2n−3 2 , where C is the constant determined in (i). © 2024 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2026 China National Olympiad www.artofproblemsolving.com/community/c4606608 by MathMaxGreat, mathematics2004, CG40, Call-of-the-Night Day1 2025.11.26"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Deﬁne the subsets of the complex numbers C: A = {z $\\in$C $|$ z = rei$\\theta$, r $\\geq$0, $\\theta$ $\\in$[0, $\\pi$/41]}, B = {z $\\in$C $|$ z = x + iy, x, y $\\in$R, $|$x −y$|$ < 2025}, where i is the imaginary unit, and rei$\\theta$ = r(cos $\\theta$ + i sin $\\theta$). Find all complex-coefﬁcient polynomials P(z) such that for every z $\\in$A, we have P(z) $\\in$B."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let convex quadrilateral ABCD be inscribed in a circle with center O and radius 1 and satisfy $\\angle$ABC < $\\angle$BCD < 90◦. Let P be the intersection of lines BA and CD, and Q be the intersection of diagonals AC and BD. Suppose there exists a point K on segment BC such that P, A, K, D are concyclic, and KB $\\cdot$ KC ="
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2OP 2. The line perpendicular to BC and passing through Q intersects line OP at point T. - Find all possible values of OP; - Find all possible values of TB + TC."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let n be a positive integer. Initially there are n red cards and n blue cards. One writes one 0 on every red card and one 1 on every blue card. An operation is to choose a red card and a blue card, such that the number on the red card is smaller than the number on the blue card, and then replace the two numbers by their arithmetic mean. Determine the smallest n such that it is possible to execute ﬁnitely many operations, so that the sum of the numbers on the red card is larger than 100. Day2 2025.11.27"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "There are 30 colors of cards, with 70 cards of each color. Initially, any 70 cards are chosen and arranged from top to bottom into a stack. One operation is deﬁned as follows: from the bottom 20 cards, choose a card X whose color does not appear among the top 50 cards; then, from the top 50 cards, choose a card Y whose color appears at least twice among the top 50 cards; extract X and insert it back immediately above Y . Repeat the above operations until no such X can be selected. -Prove that the number of operations that can be performed is ﬁnite; -For all possible initial situations and operation methods, ﬁnd the maximum possible number of operations. © 2025 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2026 China National Olympiad"
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Determine all real numbers $\\lambda$, such that there exists N > 0 satisfying the following property: For any integer n $\\geq$N and n non-negative reals x1, $\\cdot$ $\\cdot$ $\\cdot$ , xn with sum 1, the following inequality holds:   X 1$\\leq$i<j$\\leq$n xixj  "
        },
        {
          "day": 2,
          "number": 2,
          "problem": "$\\leq$$\\lambda$ X 1$\\leq$i<j<k$\\leq$n xixjxk + 1 n X 1$\\leq$i<j$\\leq$n (xi −xj)2. In fact, one may derive the optimal $\\lambda$ for any ﬁxed n. Try to rewrite the inequality in terms of Sk = Pn i=1 xk i , k = 1, 2, 3."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let n $\\geq$3 be an odd integer such that gcd(p −1, n) = 1 for every prime divisor p of n. Find the number of (a, b, c) $\\in$Z3 n in terms of n such that gcd(a, b, c, n) = 1 and there is a permutation (x1, x2, . . . , xn) of {1, 2, . . . , n} satisfying that n $|$ axk+2 + bxk+1 + cxk for 1 $\\leq$k $\\leq$n, where indices are taken module n. © 2025 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2009 China National Olympiad"
        }
      ]
    },
    {
      "year": 2015,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let z1, z2, ..., zn be complex numbers satisfying $|$zi −1$|$ $\\leq$r for some r in (0, 1). Show that  n X i=1 zi $\\cdot$  n X i=1"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "zi $\\geq$n2(1 −r2)."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let A, B, D, E, F, C be six points lie on a circle (in order) satisfy AB = AC . Let P = AD $\\cap$BE, R = AF $\\cap$CE, Q = BF $\\cap$CD, S = AD $\\cap$BF, T = AF $\\cap$CD . Let K be a point lie on ST satisfy $\\angle$QKS = $\\angle$ECA . Prove that SK KT = PQ QR"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let n $\\geq$5 be a positive integer and let A and B be sets of integers satisfying the following conditions: i) $|$A$|$ = n, $|$B$|$ = m and A is a subset of B ii) For any distinct x, y $\\in$B, x + y $\\in$B iff x, y $\\in$A Determine the minimum value of m."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Determine all integers k such that there exists inﬁnitely many positive integers n not satisfying n + k$|$ \u00122n n \u0013"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Given 30 students such that each student has at most 5 friends and for every 5 students there is a pair of students that are not friends, determine the maximum k such that for all such possible conﬁgurations, there exists k students who are all not friends."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let a1, a2, ... be a sequence of non-negative integers such that for any m, n 2m X i=1 ain $\\leq$m. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2015 China National Olympiad Show that there exist k, d such that 2k X i=1 aid = k −2014. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2016 China National Olympiad"
        }
      ]
    },
    {
      "year": 2014,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let ABC be a triangle with AB > AC. Let D be the foot of the internal angle bisector of A. Points F and E are on AC, AB respectively such that B, C, F, E are concyclic. Prove that the circumcentre of DEF is the incentre of ABC if and only if BE + CF = BC."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "For the integer n > 1, deﬁne D(n) = {a −b $|$ ab = n, a > b > 0, a, b $\\in$N}. Prove that for any integer k > 1, there exists pairwise distinct positive integers n1, n2, . . . , nk such that n1, . . . , nk > 1 and $|$D(n1) $\\cap$D(n2) $\\cap$$\\cdot$ $\\cdot$ $\\cdot$ $\\cap$D(nk)$|$ $\\geq$2."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Prove that: there exists only one function f : N∗$\\rightarrow$N∗satisfying: i) f(1) = f(2) = 1; ii)f(n) = f(f(n −1)) + f(n −f(n −1)) for n $\\geq$3. For each integer m $\\geq$2, ﬁnd the value of f(2m)."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let n = pa1 1 pa2 2 $\\cdot$ $\\cdot$ $\\cdot$ pat t be the prime factorisation of n. Deﬁne $\\omega$(n) = t and Ω(n) = a1+a2+. . .+at. Prove or disprove: For any ﬁxed positive integer k and positive reals $\\alpha$, $\\beta$, there exists a positive integer n > 1 such that i) $\\omega$(n+k) $\\omega$(n) > $\\alpha$ ii) Ω(n+k) Ω(n) < $\\beta$."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let f : X $\\rightarrow$X, where X = {1, 2, . . . , 100}, be a function satisfying: 1) f(x) = x for all x = 1, 2, . . . , 100; 2) for any subset A of X such that $|$A$|$ = 40, we have A $\\cap$f(A) = $\\emptyset$. Find the minimum k such that for any such function f, there exist a subset B of X, where $|$B$|$ = k, such that B $\\cup$f(B) = X."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "For non-empty number sets S, T, deﬁne the sets S + T = {s + t $|$ s $\\in$S, t $\\in$T} and 2S = {2s $|$ s $\\in$S}. Let n be a positive integer, and A, B be two non-empty subsets of {1, 2 . . . , n}. Show that there exists a subset D of A + B such that 1) D + D $\\subseteq$2(A + B), 2) $|$D$|$ $\\geq$$|$A$|$$\\cdot$$|$B$|$ 2n , © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2014 China National Olympiad where $|$X$|$ is the number of elements of the ﬁnite set X. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2015 China National Olympiad"
        }
      ]
    },
    {
      "year": 2013,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Two circles K1 and K2 of different radii intersect at two points A and B, let C and D be two points on K1 and K2, respectively, such that A is the midpoint of the segment CD. The exten- sion of DB meets K1 at another point E, the extension of CB meets K2 at another point F. Let l1 and l2 be the perpendicular bisectors of CD and EF, respectively. i) Show that l1 and l2 have a unique common point (denoted by P). ii) Prove that the lengths of CA, AP and PE are the side lengths of a right triangle."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Find all nonempty sets S of integers such that 3m −2n $\\in$S for all (not necessarily distinct) m, n $\\in$S."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Find all positive real numbers t with the following property: there exists an inﬁnite set X of real numbers such that the inequality max{$|$x −(a −d)$|$, $|$y −a$|$, $|$z −(a + d)$|$} > td holds for all (not necessarily distinct) x, y, z $\\in$X, all real numbers a and all positive real num- bers d."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let n ⩾2 be an integer. There are n ﬁnite sets A1, A2, . . . , An which satisfy the condition $|$Ai∆Aj$|$ = $|$i −j$|$ $\\forall$i, j $\\in${1, 2, ..., n} . Find the minimum of nP i=1 $|$Ai$|$."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "For any positive integer n and 0 ⩽i ⩽n, denote Ci n $\\equiv$c(n, i) (mod 2), where c(n, i) $\\in${0, 1}. Deﬁne f(n, q) = n X i=0 c(n, i)qi where m, n, q are positive integers and q + 1 = 2$\\alpha$ for any $\\alpha$ $\\in$N. Prove that if f(m, q) $|$f(n, q), then f(m, r) $|$f(n, r) for any positive integer r. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2013 China National Olympiad"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let m, n be positive integers. Find the minimum positive integer N which satisﬁes the fol- lowing condition. If there exists a set S of integers that contains a complete residue system module m such that $|$S$|$ = N, then there exists a nonempty set A $\\subseteq$S so that n $|$ P x$\\in$A x. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2014 China National Olympiad"
        }
      ]
    },
    {
      "year": 2012,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "In the triangle ABC, $\\angle$A is biggest. On the circumcircle of $\\triangle$ABC, let D be the midpoint of \\ ABC and E be the midpoint of \\ ACB. The circle c1 passes through A, B and is tangent to AC at A, the circle c2 passes through A, E and is tangent AD at A. c1 and c2 intersect at A and P. Prove that AP bisects $\\angle$BAC. A c1 c2 P B E C D"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let p be a prime. We arrange the numbers in {1, 2, . . . , p2} as a p $\\times$ p matrix A = (aij). Next we can select any row or column and add 1 to every number in it, or subtract 1 from every number in it. We call the arrangement good if we can change every number of the matrix to 0 in a ﬁnite number of such moves. How many good arrangements are there?"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Prove for any M > 2, there exists an increasing sequence of positive integers a1 < a2 < . . . © 2019 AoPS Incorporated"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "AoPS Community 2012 China National Olympiad satisfying: 1) ai > Mi for any i; 2) There exists a positive integer m and b1, b2, . . . , bm $\\in${−1, 1}, satisfying n = a1b1 + a2b2 + . . . + ambm if and only if n $\\in$Z/{0}."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let f(x) = (x + a)(x + b) where a, b > 0. For any reals x1, x2, . . . , xn ⩾0 satisfying x1 + x2 + . . . + xn = 1, ﬁnd the maximum of F = P 1⩽i<j⩽n min {f(xi), f(xj)}."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Consider a square-free even integer n and a prime p, such that 1) (n, p) = 1; 2) p $\\leq$2$\\sqrt{}$n; 3) There exists an integer k such that p$|$n + k2. Prove that there exists pairwise distinct positive integers a, b, c such that n = ab + bc + ca. Proposed by Hongbing Yu"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Find the smallest positive integer k such that, for any subset A of S = {1, 2, . . . , 2012} with $|$A$|$ = k, there exist three elements x, y, z in A such that x = a + b, y = b + c, z = c + a, where a, b, c are in S and are distinct integers. Proposed by Huawei Zhu © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2013 China National Olympiad"
        }
      ]
    },
    {
      "year": 2011,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, . . . , an are real numbers, prove that; n X i=1 a2 i − n X i=1 aiai+1 $\\leq$ jn"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "k (M −m)2. where an+1 = a1, M = max1$\\leq$i$\\leq$n ai, m = min1$\\leq$i$\\leq$n ai."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "On the circumcircle of the acute triangle ABC, D is the midpoint of $\\arc$ BC. Let X be a point on $\\arc$ BD, E the midpoint of $\\arc$ AX, and let S lie on $\\arc$ AC. The lines SD and BC have intersection R, and the lines SE and AX have intersection T. If RT $\\parallel$DE, prove that the incenter of the triangle ABC is on the line RT."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let A be a set consist of ﬁnite real numbers,A1, A2, $\\cdot$ $\\cdot$ $\\cdot$ , An be nonempty sets of A, such that (a) The sum of the elements of A is 0, (b) For all xi $\\in$Ai(i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n),we have x1 + x2 + $\\cdot$ $\\cdot$ $\\cdot$ + xn > 0. Prove that there exist 1 $\\leq$k $\\leq$n, and 1 $\\leq$i1 < i2 < $\\cdot$ $\\cdot$ $\\cdot$ < ik $\\leq$n, such that $|$Ai1 [ Ai2 [ $\\cdot$ $\\cdot$ $\\cdot$ [ Aik$|$ < k n$|$A$|$. Where $|$X$|$ denote the numbers of the elements in set X."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let n be an given positive integer, the set S = {1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n}.For any nonempty set A and B, ﬁnd the minimum of $|$A∆S$|$+$|$B∆S$|$+$|$C∆S$|$, where C = {a+b$|$a $\\in$A, b $\\in$B}, X∆Y = X$\\cup$Y −X$\\cap$Y."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let ai, bi, i = 1, $\\cdot$ $\\cdot$ $\\cdot$ , n are nonnegitive numbers,and n $\\geq$4,such that a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + an = b1 + b2 + $\\cdot$ $\\cdot$ $\\cdot$ + bn > 0. Find the maximum of Pn i=1 ai(ai+bi) Pn i=1 bi(ai+bi) © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2011 China National Olympiad"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let m, n be positive integer numbers. Prove that there exist inﬁnite many couples of positive integer nubmers (a, b) such that a + b$|$ama + bnb, gcd(a, b) = 1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2012 China National Olympiad"
        }
      ]
    },
    {
      "year": 2011,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, . . . , an are real numbers, prove that; n X i=1 a2 i − n X i=1 aiai+1 $\\leq$ jn"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "k (M −m)2. where an+1 = a1, M = max1$\\leq$i$\\leq$n ai, m = min1$\\leq$i$\\leq$n ai."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "On the circumcircle of the acute triangle ABC, D is the midpoint of $\\arc$ BC. Let X be a point on $\\arc$ BD, E the midpoint of $\\arc$ AX, and let S lie on $\\arc$ AC. The lines SD and BC have intersection R, and the lines SE and AX have intersection T. If RT $\\parallel$DE, prove that the incenter of the triangle ABC is on the line RT."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let A be a set consist of ﬁnite real numbers,A1, A2, $\\cdot$ $\\cdot$ $\\cdot$ , An be nonempty sets of A, such that (a) The sum of the elements of A is 0, (b) For all xi $\\in$Ai(i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n),we have x1 + x2 + $\\cdot$ $\\cdot$ $\\cdot$ + xn > 0. Prove that there exist 1 $\\leq$k $\\leq$n, and 1 $\\leq$i1 < i2 < $\\cdot$ $\\cdot$ $\\cdot$ < ik $\\leq$n, such that $|$Ai1 [ Ai2 [ $\\cdot$ $\\cdot$ $\\cdot$ [ Aik$|$ < k n$|$A$|$. Where $|$X$|$ denote the numbers of the elements in set X."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let n be an given positive integer, the set S = {1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n}.For any nonempty set A and B, ﬁnd the minimum of $|$A∆S$|$+$|$B∆S$|$+$|$C∆S$|$, where C = {a+b$|$a $\\in$A, b $\\in$B}, X∆Y = X$\\cup$Y −X$\\cap$Y."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let ai, bi, i = 1, $\\cdot$ $\\cdot$ $\\cdot$ , n are nonnegitive numbers,and n $\\geq$4,such that a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + an = b1 + b2 + $\\cdot$ $\\cdot$ $\\cdot$ + bn > 0. Find the maximum of Pn i=1 ai(ai+bi) Pn i=1 bi(ai+bi) © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2011 China National Olympiad"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let m, n be positive integer numbers. Prove that there exist inﬁnite many couples of positive integer nubmers (a, b) such that a + b$|$ama + bnb, gcd(a, b) = 1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School."
        }
      ]
    },
    {
      "year": 2010,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Two circles $\\Gamma$1 and $\\Gamma$2 meet at A and B. A line through B meets $\\Gamma$1 and $\\Gamma$2 again at C and D repsectively. Another line through B meets $\\Gamma$1 and $\\Gamma$2 again at E and F repsectively. Line CF meets $\\Gamma$1 and $\\Gamma$2 again at P and Q respectively. M and N are midpoints of arc PB and arc QB repsectively. Show that if CD = EF, then C, F, M, N are concyclic."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let k be an integer $\\geq$3. Sequence {an} satisﬁes that ak = 2k and for all n > k, we have an = ( an−1 + 1 if (an−1, n) = 1 2n if (an−1, n) > 1 Prove that there are inﬁnitely many primes in the sequence {an −an−1}."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given complex numbers a, b, c, we have that $|$az2 + bz + c$|$ $\\leq$1 holds true for any complex number z, $|$z$|$ $\\leq$1. Find the maximum value of $|$bc$|$."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let m, n $\\geq$1 and a1 < a2 < . . . < an be integers. Prove that there exists a subset T of N such that $|$T$|$ $\\leq$1 + an −a1 2n + 1 and for every i $\\in${1, 2, . . . , m}, there exists t $\\in$T and s $\\in$[−n, n], such that ai = t + s."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "There is a deck of cards placed at every points A1, A2, . . . , An and O, where n $\\geq$3. We can do one of the following two operations at each step: 1) If there are more than 2 cards at some points Ai, we can withdraw three cards from that deck and place one each at Ai−1, Ai+1 and O. (Here A0 = An and An+1 = A1); 2) If there are more than or equal to n cards at point O, we can withdraw n cards from that deck and place one each at A1, A2, . . . , An. Show that if the total number of cards is more than or equal to n2 + 3n + 1, we can make the number of cards at every points more than or equal to n + 1 after ﬁnitely many steps."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Suppose a1, a2, a3, b1, b2, b3 are distinct positive integers such that (n + 1)an 1 + nan 2 + (n −1)an 3$|$(n + 1)bn 1 + nbn 2 + (n −1)bn"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "holds for all positive integers n. Prove that there exists k $\\in$N such that bi = kai for i = 1, 2, 3. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2011 China National Olympiad"
        }
      ]
    },
    {
      "year": 2010,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Two circles $\\Gamma$1 and $\\Gamma$2 meet at A and B. A line through B meets $\\Gamma$1 and $\\Gamma$2 again at C and D repsectively. Another line through B meets $\\Gamma$1 and $\\Gamma$2 again at E and F repsectively. Line CF meets $\\Gamma$1 and $\\Gamma$2 again at P and Q respectively. M and N are midpoints of arc PB and arc QB repsectively. Show that if CD = EF, then C, F, M, N are concyclic."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let k be an integer $\\geq$3. Sequence {an} satisﬁes that ak = 2k and for all n > k, we have an = ( an−1 + 1 if (an−1, n) = 1 2n if (an−1, n) > 1 Prove that there are inﬁnitely many primes in the sequence {an −an−1}."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given complex numbers a, b, c, we have that $|$az2 + bz + c$|$ $\\leq$1 holds true for any complex number z, $|$z$|$ $\\leq$1. Find the maximum value of $|$bc$|$."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let m, n $\\geq$1 and a1 < a2 < . . . < an be integers. Prove that there exists a subset T of N such that $|$T$|$ $\\leq$1 + an −a1 2n + 1 and for every i $\\in${1, 2, . . . , m}, there exists t $\\in$T and s $\\in$[−n, n], such that ai = t + s."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "There is a deck of cards placed at every points A1, A2, . . . , An and O, where n $\\geq$3. We can do one of the following two operations at each step: 1) If there are more than 2 cards at some points Ai, we can withdraw three cards from that deck and place one each at Ai−1, Ai+1 and O. (Here A0 = An and An+1 = A1); 2) If there are more than or equal to n cards at point O, we can withdraw n cards from that deck and place one each at A1, A2, . . . , An. Show that if the total number of cards is more than or equal to n2 + 3n + 1, we can make the number of cards at every points more than or equal to n + 1 after ﬁnitely many steps."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Suppose a1, a2, a3, b1, b2, b3 are distinct positive integers such that (n + 1)an 1 + nan 2 + (n −1)an 3$|$(n + 1)bn 1 + nbn 2 + (n −1)bn"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "holds for all positive integers n. Prove that there exists k $\\in$N such that bi = kai for i = 1, 2, 3. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2011 China National Olympiad"
        }
      ]
    },
    {
      "year": 2009,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Given an acute triangle PBC with PB = PC. Points A, D lie on PB, PC, respectively. AC in- tersects BD at point O. Let E, F be the feet of perpendiculars from O to AB, CD, respectively. Denote by M, N the midpoints of BC, AD. (1): If four points A, B, C, D lie on one circle, then EM $\\cdot$ FN = EN $\\cdot$ FM. (2): Determine whether the converse of (1) is true or not, justify your answer."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Find all the pairs of prime numbers (p, q) such that pq$|$5p + 5q."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given two integers m, n satisfying 4 < m < n. Let A1A2 $\\cdot$ $\\cdot$ $\\cdot$ A2n+1 be a regular 2n + 1 polygon. Denote by P the set of its vertices. Find the number of convex m polygon whose vertices belongs to P and exactly has two acute angles."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Given an integer n > 3. Let a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , an be real numbers satisfying min$|$ai −aj$|$ = 1, 1 $\\leq$i $\\leq$ j $\\leq$n. Find the minimum value of Pn k=1 $|$ak$|$3."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let P be a convex n polygon each of which sides and diagnoals is colored with one of n distinct colors. For which n does: there exists a coloring method such that for any three of n colors, we can always ﬁnd one triangle whose vertices is of P’ and whose sides is colored by the three colors respectively."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Given an integer n > 3. Prove that there exists a set S consisting of n pairwisely distinct pos- itive integers such that for any two different non-empty subset of S:A, B, P x$\\in$A x $|$A$|$ and P x$\\in$B x $|$B$|$ are two composites which share no common divisors. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1987 China National Olympiad"
        }
      ]
    },
    {
      "year": 2008,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Suppose $\\triangle$ABC is scalene. O is the circumcenter and A′ is a point on the extension of seg- ment AO such that $\\angle$BA′A = $\\angle$CA′A. Let point A1 and A2 be foot of perpendicular from A′ onto AB and AC. HA is the foot of perpendicular from A onto BC. Denote RA to be the radius of circumcircle of $\\triangle$HAA1A2. Similiarly we can deﬁne RB and RC. Show that:"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "RA + 1 RB + 1 RC = 2 R where R is the radius of circumcircle of $\\triangle$ABC."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given an integer n $\\geq$3, prove that the set X = {1, 2, 3, . . . , n2 −n} can be divided into two non-intersecting subsets such that neither of them contains n elements a1, a2, . . . , an with a1 < a2 < . . . < an and ak $\\leq$ak−1+ak+1"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "for all k = 2, . . . , n −1."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given a positive integer n and x1 $\\leq$x2 $\\leq$. . . $\\leq$xn, y1 $\\geq$y2 $\\geq$. . . $\\geq$yn, satisfying n X i=1 ixi = n X i=1 iyi Show that for any real number $\\alpha$, we have n X i=1 xi[i$\\alpha$] $\\geq$ n X i=1 yi[i$\\alpha$] Here [$\\beta$] denotes the greastest integer not larger than $\\beta$."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let A be an inﬁnite subset of N, and n a ﬁxed integer. For any prime p not dividing n, There are inﬁnitely many elements of A not divisible by p. Show that for any integer m > 1, (m, n) = 1, There exist ﬁnitely many elements of A, such that their sum is congruent to 1 modulo m and congruent to 0 modulo n."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Find the smallest integer n satisfying the following condition: regardless of how one colour the vertices of a regular n-gon with either red, yellow or blue, one can always ﬁnd an isosceles trapezoid whose vertices are of the same colour. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2008 China National Olympiad"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Find all triples (p, q, n) that satisfy qn+2 $\\equiv$3n+2( mod pn), pn+2 $\\equiv$3n+2( mod qn) where p, q are odd primes and n is an positive integer. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2010 China National Olympiad"
        }
      ]
    },
    {
      "year": 2007,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Given complex numbers a, b, c, let $|$a + b$|$ = m, $|$a −b$|$ = n. If mn = 0, Show that max{$|$ac + b$|$, $|$a + bc$|$} $\\geq$ mn $\\sqrt{}$ m2 + n2"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Show that: 1) If 2n −1 is a prime number, then for any n pairwise distinct positive integers a1, a2, . . . , an, there exists i, j $\\in${1, 2, . . . , n} such that ai + aj (ai, aj) $\\geq$2n −1 2) If 2n −1 is a composite number, then there exists n pairwise distinct positive integers a1, a2, . . . , an, such that for any i, j $\\in${1, 2, . . . , n} we have ai + aj (ai, aj) < 2n −1 Here (x, y) denotes the greatest common divisor of x, y."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let a1, a2, . . . , a11 be 11 pairwise distinct positive integer with sum less than 2007. Let S be the sequence of 1, 2, . . . , 2007. Deﬁne an operation to be 22 consecutive applications of the following steps on the sequence S: on i-th step, choose a number from the sequense S at ran- dom, say x. If 1 $\\leq$i $\\leq$11, replace x with x + ai ; if 12 $\\leq$i $\\leq$22, replace x with x −ai−11 . If the result of operation on the sequence S is an odd permutation of {1, 2, . . . , 2007}, it is an odd op- eration; if the result of operation on the sequence S is an even permutation of {1, 2, . . . , 2007}, it is an even operation. Which is larger, the number of odd operation or the number of even permutation? And by how many? Here {x1, x2, . . . , x2007} is an even permutation of {1, 2, . . . , 2007} if the product Q i>j(xi −xj) is positive, and an odd one otherwise."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let O, I be the circumcenter and incenter of triangle ABC. The incircle of $\\triangle$ABC touches BC, CA, AB at points D, E, F repsectively. FD meets CA at P, ED meets AB at Q. M and N are midpoints of PE and QF respectively. Show that OI $\\perp$MN. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2007 China National Olympiad"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let {an}n$\\geq$1 be a bounded sequence satisfying an < 2n+2006 X k=a ak k + 1 +"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2n + 2007 $\\forall$ n = 1, 2, 3, . . . Show that an < 1 n $\\forall$ n = 1, 2, 3, . . ."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Find a number n $\\geq$9 such that for any n numbers, not necessarily distinct, a1, a2, . . . , an, there exists 9 numbers ai1, ai2, . . . , ai9, (1 $\\leq$i1 < i2 < . . . < i9 $\\leq$n) and bi $\\in$4, 7, i = 1, 2, . . . , 9 such that b1ai1 + b2ai2 + . . . + b9ai9 is a multiple of 9. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2008 China National Olympiad"
        }
      ]
    },
    {
      "year": 2006,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, . . . , ak be real numbers and a1 + a2 + . . . + ak = 0. Prove that max 1$\\leq$i$\\leq$k a2 i $\\leq$k"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "\u0000(a1 −a2)2 + (a2 −a3)2 + $\\cdot$ $\\cdot$ $\\cdot$ + (ak−1 −ak)2\u0001 ."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "For positive integers a1, a2, . . . , a2006 such that a1 a2 , a2 a3 , . . . , a2005 a2006 are pairwise distinct, ﬁnd the minimum possible amount of distinct positive integers in the set{a1, a2, ..., a2006}."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Positive integers k, m, n satisfy mn = k2 + k + 3, prove that at least one of the equations x2 + 11y2 = 4m and x2 + 11y2 = 4n has an odd solution."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "In a right angled-triangle ABC, $\\angle$ACB = 90o. Its incircle O meets BC, AC, AB at D,E,F re- spectively. AD cuts O at P. If $\\angle$BPC = 90o, prove AE + AP = PD."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Let {an} be a sequence such that: a1 = 1 2, ak+1 = −ak +"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2−ak for all k = 1, 2, . . .. Prove that \u0012 n 2(a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + an) −1 \u0013n $\\leq$ \u0012a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + an n \u0013n \u0012 1 a1 −1 \u0013 \u0012 1 a2 −1 \u0013 $\\cdot$ $\\cdot$ $\\cdot$ \u0012 1 an −1 \u0013 ."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Suppose X is a set with $|$X$|$ = 56. Find the minimum value of n, so that for any 15 subsets of X, if the cardinality of the union of any 7 of them is greater or equal to n, then there exists 3 of them whose intersection is nonempty. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2007 China National Olympiad"
        }
      ]
    },
    {
      "year": 2005,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Suppose $\\theta$i $\\in$(−$\\pi$ 2 , $\\pi$ 2 ), i = 1, 2, 3, 4. Prove that, there exist x $\\in$R, satisfying two inequalities cos2 $\\theta$1 cos2 $\\theta$2 −(sin $\\theta$ sin $\\theta$2 −x)2 $\\geq$ 0, cos2 $\\theta$3 cos2 $\\theta$4 −(sin $\\theta$3 sin $\\theta$4 −x)2 $\\geq$"
        },
        {
          "day": 1,
          "number": 0,
          "problem": "if and only if"
        },
        {
          "day": 1,
          "number": 4,
          "problem": "X i=1 sin2 $\\theta$i $\\leq$2(1 +"
        },
        {
          "day": 1,
          "number": 4,
          "problem": "Y i=1 sin $\\theta$i +"
        },
        {
          "day": 1,
          "number": 4,
          "problem": "Y i=1 cos $\\theta$i)."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "A circle meets the three sides BC, CA, AB of a triangle ABC at points D1, D2; E1, E2; F1, F2 respectively. Furthermore, line segments D1E1 and D2F2 intersect at point L, line segments E1F1 and E2D2 intersect at point M, line segments F1D1 and F2E2 intersect at point N. Prove that the lines AL, BM, CN are concurrent."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "As the graph, a pond is divided into 2n (n $\\geq$5) parts. Two parts are called neighborhood if they have a common side or arc. Thus every part has three neighborhoods. Now there are 4n+1 frogs at the pond. If there are three or more frogs at one part, then three of the frogs of the part will jump to the three neighborhoods repsectively. Prove that for some time later, the frogs at the pond will uniformily distribute. That is, for any part either there are frogs at the part or there are frogs at the each of its neighborhoods. http://www.mathlinks.ro/Forum/files/china2005_2_214.gif"
        },
        {
          "day": 2,
          "number": 4,
          "problem": "The sequence {an} is deﬁned by: a1 = 21 16, and for n $\\geq$2, 2an −3an−1 ="
        },
        {
          "day": 2,
          "number": 3,
          "problem": "2n+1 . Let m be an integer with m $\\geq$2. Prove that: for n $\\leq$m, we have \u0012 an +"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "2n+3 \u0013 1 m  m − \u00122"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "\u0013 n(m−1) m  < m2 −1 m −n + 1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2005 China National Olympiad"
        },
        {
          "day": 2,
          "number": 5,
          "problem": "There are 5 points in a rectangle (including its boundary) with area 1, no three of them are in the same line. Find the minimum number of triangles with the area not more than 1 4, vertex of which are three of the ﬁve points."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Find all nonnegative integer solutions (x, y, z, w) of the equation 2x $\\cdot$ 3y −5z $\\cdot$ 7w = 1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2006 China National Olympiad"
        }
      ]
    },
    {
      "year": 2004,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let EFGH, ABCD and E1F1G1H1 be three convex quadrilaterals satisfying: i) The points E, F, G and H lie on the sides AB, BC, CD and DA respectively, and AE EB $\\cdot$ BF FC $\\cdot$ CG GD $\\cdot$ DH HA = 1; ii) The points A, B, C and D lie on sides H1E1, E1F1, F1, G1 and G1H1 respectively, and E1F1$|$$|$EF, F1G1$|$$|$FG Suppose that E1A AH1 = $\\lambda$. Find an expression for F1C CG1 in terms of $\\lambda$. Xiong Bin"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let c be a positive integer. Consider the sequence x1, x2, . . . which satisﬁes x1 = c and, for n $\\geq$2, xn = xn−1 + \u00162xn−1 −(n + 2) n \u0017 + 1 where $\\lfloor$x$\\rfloor$denotes the largest integer not greater than x. Determine an expression for xn in terms of n and c. Huang Yumin"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let M be a set consisting of n points in the plane, satisfying: i) there exist 7 points in M which constitute the vertices of a convex heptagon; ii) if for any 5 points in M which constitute the vertices of a convex pentagon, then there is a point in M which lies in the interior of the pentagon. Find the minimum value of n. Leng Gangsong"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "For a given real number a and a positive integer n, prove that: i) there exists exactly one sequence of real numbers x0, x1, . . . , xn, xn+1 such that ( x0 = xn+1 = 0,"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2(xi + xi+1) = xi + x3 i −a3, i = 1, 2, . . . , n. ii) the sequence x0, x1, . . . , xn, xn+1 in i) satisﬁes $|$xi$|$ $\\leq$$|$a$|$ where i = 0, 1, . . . , n + 1. Liang Yengde © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2004 China National Olympiad"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "For a given positive integer n $\\geq$2, suppose positive integers ai where 1 $\\leq$i $\\leq$n satisfy a1 < a2 < . . . < an and Pn i=1"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "ai $\\leq$1. Prove that, for any real number x, the following inequality holds n X i=1"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "a2 i + x2 !2 $\\leq$1 2 $\\cdot$"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "a1(a1 −1) + x2 Li Shenghong"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Prove that every positive integer n, except a ﬁnite number of them, can be represented as a sum of 2004 positive integers: n = a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + a2004, where 1 $\\leq$a1 < a2 < $\\cdot$ $\\cdot$ $\\cdot$ < a2004, and ai $|$ ai+1 for all 1 $\\leq$i $\\leq$2003. Chen Yonggao © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2005 China National Olympiad"
        }
      ]
    },
    {
      "year": 2003,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let I and H be the incentre and orthocentre of triangle ABC respectively. Let P, Q be the midpoints of AB, AC. The rays PI, QI intersect AC, AB at R, S respectively. Suppose that T is the circumcentre of triangle BHC. Let RS intersect BC at K. Prove that A, I and T are collinear if and only if [BKS] = [CKR]. Shen Wunxuan"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Determine the maximal size of the set S such that: i) all elements of S are natural numbers not exceeding 100; ii) for any two elements a, b in S, there exists c in S such that (a, c) = (b, c) = 1; iii) for any two elements a, b in S, there exists d in S such that (a, d) > 1, (b, d) > 1. Yao Jiangang"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given a positive integer n, ﬁnd the least $\\lambda$ > 0 such that for any x1, . . . xn $\\in$ \u00000, $\\pi$"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "\u0001 , the condition Qn i=1 tan xi = 2 n 2 implies Pn i=1 cos xi $\\leq$$\\lambda$. Huang Yumin"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Find all integer triples (a, m, n) such that am + 1$|$an + 203 where a, m > 1. Chen Yonggao"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Ten people apply for a job. The manager decides to interview the candidates one by one ac- cording to the following conditions: i) the ﬁrst three candidates will not be employed; ii) from the fourth candidates onwards, if a candidate’s comptence surpasses the competence of all those who preceded him, then that candidate is employed; iii) if the ﬁrst nine candidates are not employed, then the tenth candidate will be employed. We assume that none of the 10 applicants have the same competence, and these competences can be ranked from the ﬁrst to tenth. Let Pk represent the probability that the kth-ranked ap- plicant in competence is employed. Prove that: i) P1 > P2 > . . . > P8 = P9 = P10; ii) P1 + P2 + P3 > 0.7 iii) P8 + P9 + P10 $\\leq$0.1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2003 China National Olympiad Su Chun"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Suppose a, b, c, d are positive reals such that ab + cd = 1 and xi, yi are real numbers such that x2 i + y2 i = 1 for i = 1, 2, 3, 4. Prove that (ax1 + bx2 + cx3 + dx4)2 + (ay4 + by3 + cy2 + dy1)2 $\\leq$2 \u0012a2 + b2 ab + c2 + d2 cd \u0013 . Li Shenghong © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2004 China National Olympiad"
        }
      ]
    },
    {
      "year": 2002,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "the edges of triangle ABC are a, b, c respectively,b < c,AD is the bisector of $\\angle$A,point D is on segment BC. (1)ﬁnd the property $\\angle$A,$\\angle$B,$\\angle$C have,so that there exists point E, F on AB, AC satisfy BE = CF,and $\\angle$NDE = $\\angle$CDF (2)when such E, F exist,express BE with a, b, c"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given the polynomial sequence (pn(x)) satisfying p1(x) = x2 −1, p2(x) = 2x(x2 −1), and pn+1(x)pn−1(x) = (pn(x)2 −(x2 −1)2, for n $\\geq$2, let sn be the sum of the absolute values of the coefﬁcients of pn(x). For each n, ﬁnd a non-negative integer kn such that 2−knsn is odd."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "In a competition there are 18 teams and in each round 18 teams are divided into 9 pairs where the 9 matches are played coincidentally. There are 17 rounds, so that each pair of teams play each other exactly once. After n rounds, there always exists 4 teams such that there was ex- actly one match played between these teams in those n rounds. Find the maximum value of n."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "For every four points P1, P2, P3, P4 on the plane, ﬁnd the minimum value of P 1$\\leq$i<j$\\leq$4 PiPj min1$\\leq$i<j$\\leq$4(PiPj)."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Suppose that a point in the plane is called good if it has rational coordinates. Prove that all good points can be divided into three sets satisfying: 1) If the centre of the circle is good, then there are three points in the circle from each of the three sets. 2) There are no three collinear points that are from each of the three sets."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Suppose that c $\\in$ \u0000 1 2, 1 \u0001 . Find the least M such that for every integer n $\\geq$2 and real numbers 0 < a1 $\\leq$a2 $\\leq$. . . $\\leq$an, if 1 n Pn k=1 kak = c Pn k=1 ak, then we always have that Pn k=1 ak $\\leq$ M Pm k=1 ak where m = [cn] © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2003 China National Olympiad"
        }
      ]
    },
    {
      "year": 2001,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a be real number with $\\sqrt{}$ 2 < a < 2, and let ABCD be a convex cyclic quadrilateral whose circumcentre O lies in its interior. The quadrilateral’s circumcircle $\\omega$ has radius 1, and the longest and shortest sides of the quadrilateral have length a and $\\sqrt{}$ 4 −a2, respectively. Lines LA, LB, LC, LD are tangent to $\\omega$ at A, B, C, D, respectively. Let lines LA and LB, LB and LC,LC and LD,LD and LA intersect at A′, B′, C′, D′ respectively. Determine the minimum value of SA′B′C′D′ SABCD ."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let X = {1, 2, . . . , 2001}. Find the least positive integer m such that for each subset W $\\subset$X with m elements, there exist u, v $\\in$W (not necessarily distinct) such that u + v is of the form 2k, where k is a positive integer."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let P be a regular n-gon A1A2 . . . An. Find all positive integers n such that for each permu- tation $\\sigma$(1), $\\sigma$(2), . . . , $\\sigma$(n) there exists 1 $\\leq$i, j, k $\\leq$n such that the triangles AiAjAk and A$\\sigma$(i)A$\\sigma$(j)A$\\sigma$(k) are both acute, both right or both obtuse."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let a, b, c be positive integers such that a, b, c, a+b−c, a+c−b, b+c−a, a+b+c are 7 distinct primes. The sum of two of a, b, c is 800. If d be the difference of the largest prime and the least prime among those 7 primes, ﬁnd the maximum value of d."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let P1P2 . . . P24 be a regular 24-sided polygon inscribed in a circle $\\omega$ with circumference 24. Determine the number of ways to choose sets of eight distinct vertices from these 24 such that none of the arcs has length 3 or 8."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let a = 2001. Consider the set A of all pairs of integers (m, n) with n = 0 such that (i) m < 2a; (ii) 2n$|$(2am −m2 + n2); (iii) n2 −m2 + 2mn $\\leq$2a(n −m). For (m, n) $\\in$A, let f(m, n) = 2am −m2 −mn n . Determine the maximum and minimum values of f. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2002 China National Olympiad"
        }
      ]
    },
    {
      "year": 2000,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "The sides a, b, c of triangle ABC satisfy a $\\leq$b $\\leq$c. The circumradius and inradius of triangle ABC are R and r respectively. Let f = a+b−2R −2r. Determine the sign of f by the measure of angle C."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "A sequence (an) is deﬁned recursively by a1 = 0, a2 = 1 and for n $\\geq$3, an = 1 2nan−1 + 1 2n(n −1)an−2 + (−1)n \u0010 1 −n"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "\u0011 . Find a closed-form expression for fn = an+2 \u0000n"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "\u0001 an−1+3 \u0000n"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "\u0001 an−2+. . .+(n−1) \u0000 n n−2 \u0001 a2+n \u0000 n n−1 \u0001 a1."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "A table tennis club hosts a series of doubles matches following several rules: (i) each player belongs to two pairs at most; (ii) every two distinct pairs play one game against each other at most; (iii) players in the same pair do not play against each other when they pair with others respec- tively. Every player plays a certain number of games in this series. All these distinct numbers make up a set called the set of games. Consider a set A = {a1, a2, . . . , ak} of positive integers such that every element in A is divisible by 6. Determine the minimum number of players needed to participate in this series so that a schedule for which the corresponding set of games is equal to set A exists."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Given an ordered n-tuple A = (a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , an) of real numbers, where n $\\geq$2, we deﬁne bk = max a1, . . . ak for each k. We deﬁne B = (b1, b2, $\\cdot$ $\\cdot$ $\\cdot$ , bn) to be the innovated tuple of A. The number of distinct elements in B is called the innovated degree of A. Consider all permutations of 1, 2, . . . , n as an ordered n-tuple. Find the arithmetic mean of the ﬁrst term of the permutations whose innovated degrees are all equal to 2"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Find all positive integers n such that there exists integers n1, . . . , nk $\\geq$3, for some integer k, satisfying n = n1n2 $\\cdot$ $\\cdot$ $\\cdot$ nk = 2"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2k (n1−1)$\\cdot$$\\cdot$$\\cdot$(nk−1) −1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 2000 China National Olympiad"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "A test contains 5 multiple choice questions which have 4 options in each. Suppose each exam- inee chose one option for each question. There exists a number n, such that for any n sheets among 2000 sheets of answer papers, there are 4 sheets of answer papers such that any two of them have at most 3 questions with the same answers. Find the minimum value of n. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2001 China National Olympiad"
        }
      ]
    },
    {
      "year": 1999,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let ABC be an acute triangle with $\\angle$C > $\\angle$B. Let D be a point on BC such that $\\angle$ADB is obtuse, and let H be the orthocentre of triangle ABD. Suppose that F is a point inside triangle ABC that is on the circumcircle of triangle ABD. Prove that F is the orthocenter of triangle ABC if and only if HD$|$$|$CF and H is on the circumcircle of triangle ABC."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let a be a real number. Let (fn(x))n$\\geq$0 be a sequence of polynomials such that f0(x) = 1 and fn+1(x) = xfn(x) + fn(ax) for all non-negative integers n. a) Prove that fn(x) = xnfn \u0000x−1\u0001 for all non-negative integers n. b) Find an explicit expression for fn(x)."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "There are 99 space stations. Each pair of space stations is connected by a tunnel. There are 99 two-way main tunnels, and all the other tunnels are strictly one-way tunnels. A group of 4 space stations is called connected if one can reach each station in the group from every other station in the group without using any tunnels other than the 6 tunnels which connect them. Determine the maximum number of connected groups."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Let m be a positive integer. Prove that there are integers a, b, k, such that both a and b are odd, k $\\geq$0 and 2m = a19 + b99 + k $\\cdot$ 21999"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Determine the maximum value of $\\lambda$ such that if f(x) = x3 + ax2 + bx + c is a cubic polynomial with all its roots nonnegative, then f(x) $\\geq$$\\lambda$(x −a)3 for all x $\\geq$0. Find the equality condition."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "A 4$\\times$4$\\times$4 cube is composed of 64 unit cubes. The faces of 16 unit cubes are to be coloured red. A colouring is called interesting if there is exactly 1 red unit cube in every 1 $\\times$ 1 $\\times$ 4 rectangular box composed of 4 unit cubes. Determine the number of interesting colourings. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 2000 China National Olympiad"
        }
      ]
    },
    {
      "year": 1998,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let ABC be a non-obtuse triangle satisfying AB > AC and $\\angle$B = 45◦. The circumcentre O and incentre I of triangle ABC are such that $\\sqrt{}$ 2 OI = AB −AC. Find the value of sin A."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given a positive integer n > 1, determine with proof if there exist 2n pairwise different positive integers a1, . . . , an, b1, . . . bn such that a1 + . . . + an = b1 + . . . + bn and n −1 > n X i=1 ai −bi ai + bi > n −1 −"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "1998."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let S = {1, 2, . . . , 98}. Find the least natural number n such that we can pick out 10 numbers in any n-element subset of S satisfying the following condition: no matter how we equally divide the 10 numbers into two groups, there exists a number in one group such that it is coprime to the other numbers in that group, meanwhile there also exists a number in the other group such that it is not coprime to any of the other numbers in the same group."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Find all natural numbers n > 3, such that 22000 is divisible by 1 + C1 n + C2 n + C3 n."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let D be a point inside acute triangle ABC satisfying the condition DA $\\cdot$ DB $\\cdot$ AB + DB $\\cdot$ DC $\\cdot$ BC + DC $\\cdot$ DA $\\cdot$ CA = AB $\\cdot$ BC $\\cdot$ CA. Determine (with proof) the geometric position of point D."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let x1, x2, . . . , xn be real numbers, where n $\\geq$2, satisfying Pn i=1 x2 i + Pn−1 i=1 xixi+1 = 1 . For each k, ﬁnd the maximal value of $|$xk$|$. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1999 China National Olympiad"
        }
      ]
    },
    {
      "year": 1997,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let x1, x2, . . . , x1997 be real numbers satisfying the following conditions: i) −1 $\\sqrt{}$ 3 $\\leq$xi $\\leq$ $\\sqrt{}$ 3 for i = 1, 2, . . . , 1997; ii) x1 + x2 + $\\cdot$ $\\cdot$ $\\cdot$ + x1997 = −318 $\\sqrt{}$ 3 . Determine (with proof) the maximum value of x12 1 + x12 2 + . . . + x12 1997 ."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let A1B1C1D1 be an arbitrary convex quadrilateral. P is a point inside the quadrilateral such that each angle enclosed by one edge and one ray which starts at one vertex on that edge and passes through point P is acute. We recursively deﬁne points Ak, Bk, Ck, Dk symmetric to P with respect to lines Ak−1Bk−1, Bk−1Ck−1, Ck−1Dk−1, Dk−1Ak−1 respectively for k $\\geq$2. Consider the sequence of quadrilaterals AiBiCiDi. i) Among the ﬁrst 12 quadrilaterals, which are similar to the 1997th quadrilateral and which are not? ii) Suppose the 1997th quadrilateral is cyclic. Among the ﬁrst 12 quadrilaterals, which are cyclic and which are not?"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Prove that there are inﬁnitely many natural numbers n such that we can divide 1, 2, . . . , 3n into three sequences (an), (bn) and (cn), with n terms in each, satisfying the following conditions: i) a1 + b1 + c1 = a2 + b2 + c2 = . . . = an + bn + cn and a1 + b1 + c1 is divisible by 6; ii) a1 + a2 + . . . + an = b1 + b2 + . . . + bn = c1 + c2 + . . . + cn, and a1 + a2 + . . . + an is divisible by 6."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Consider a cyclic quadrilateral ABCD. The extensions of its sides AB, DC meet at the point P and the extensions of its sides AD, BC meet at the point Q. Suppose QE, QF are tangents to the circumcircle of quadrilateral ABCD at E, F respectively. Show that P, E, F are collinear."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let A = {1, 2, 3, $\\cdot$ $\\cdot$ $\\cdot$ , 17}. A mapping f : A $\\rightarrow$A is deﬁned as follows: f[1](x) = f(x), f[k+1](x) = f(f[k](x)) for k $\\in$N. Suppose that f is bijective and that there exists a natural number M such that: i) when m < M and 1 $\\leq$i $\\leq$16, we have f[m](i + 1) −f[m](i) = $\\pm$1 (mod 17) and f[m](1) − f[m](17) = $\\pm$1 (mod 17); ii) when 1 $\\leq$i $\\leq$16, we have f[M](i + 1) −f[M](i) = $\\pm$1 (mod 17) and f[M](1) −f[M](17) = $\\pm$1 © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 1997 China National Olympiad (mod 17). Find the maximal value of M."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let (an) be a sequence of non-negative real numbers satisfying an+m $\\leq$an + am for all non- negative integers m, n. Prove that if n $\\geq$m then an $\\leq$ma1 + \u0010 n m −1 \u0011 am holds. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1998 China National Olympiad"
        }
      ]
    },
    {
      "year": 1996,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let $\\triangle$ABC be a triangle with orthocentre H. The tangent lines from A to the circle with diam- eter BC touch this circle at P and Q. Prove that H, P and Q are collinear."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Find the smallest positive integer K such that every K-element subset of {1, 2, ..., 50} contains two distinct elements a, b such that a + b divides ab."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Suppose that the function f : R $\\rightarrow$R satisﬁes f(x3 + y3) = (x + y)(f(x)2 −f(x)f(y) + f(y)2) for all x, y $\\in$R. Prove that f(1996x) = 1996f(x) for all x $\\in$R."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "8 singers take part in a festival. The organiser wants to plan m concerts. For every concert there are 4 singers who go on stage, with the restriction that the times of which every two singers go on stage in a concert are all equal. Find a schedule that minimises m."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let n be a natural number. Suppose that x0 = 0 and that xi > 0 for all i $\\in${1, 2, . . . , n}. If Pn i=1 xi = 1 , prove that 1 $\\leq$ n X i=1 xi $\\sqrt{}$1 + x0 + x1 + . . . + xi−1 $\\sqrt{}$xi + . . . + xn < $\\pi$"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "In the triangle ABC, $\\angle$C = 90◦, $\\angle$A = 30◦and BC = 1. Find the minimum value of the longest side of all inscribed triangles (i.e. triangles with vertices on each of three sides) of the triangle ABC. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1997 China National Olympiad"
        }
      ]
    },
    {
      "year": 1995,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , an; b1, b2, $\\cdot$ $\\cdot$ $\\cdot$ , bn(n $\\geq$3) be real numbers satisfying the following conditions: (1) a1 + a2 + $\\cdot$ $\\cdot$ $\\cdot$ + an = b1 + b2 + $\\cdot$ $\\cdot$ $\\cdot$ + bn; (2) 0 < a1 = a2, ai + ai+1 = ai+2 (i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n −2); (3) 0 < b1 $\\leq$b2, bi + bi+1 $\\leq$bi+2 (i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n −2). Prove that an−1 + an $\\leq$bn−1 + bn."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let f : N $\\rightarrow$N be a function satisfying the following conditions: (1) f(1) = 1; (2) $\\forall$n $\\in$N, 3f(n)f(2n + 1) = f(2n)(1 + 3f(n)); (3) $\\forall$n $\\in$N, f(2n) < 6f(n). Find all solutions of equation f(k) + f(l) = 293, where k < l. (N denotes the set of all natural numbers)."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Find the minimun value of P10 i=1 P10 j=1 P10 k=1 $|$k(x + y −10i)(3x −6y −36j)(19x + 95y −95k)$|$ , where x, y are integers."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Given four spheres with their radii equal to 2, 2, 3, 3 respectively, each sphere externally touches the other spheres. Suppose that there is another sphere that is externally tangent to all those four spheres, determine the radius of this sphere."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Let a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , a10 be pairwise distinct natural numbers with their sum equal to 1995. Find the minimal value of a1a2 + a2a3 + $\\cdot$ $\\cdot$ $\\cdot$ + a9a10 + a10a1."
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let n(n > 1) be an odd. We deﬁne xk = (x(k) 1 , x(k) 2 , $\\cdot$ $\\cdot$ $\\cdot$ , x(k) n ) as follow: x0 = (x(0) 1 , x(0) 2 , $\\cdot$ $\\cdot$ $\\cdot$ , x(0) n ) = (1, 0, $\\cdot$ $\\cdot$ $\\cdot$ , 0, 1); x(k) i = ( 0, x(k−1) i = x(k−1) i+1 , 1, x(k−1) i = x(k−1) i+1 , i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n, where x(k−1) n+1 = x(k−1)"
        },
        {
          "day": 2,
          "number": 1,
          "problem": ". Let m be a positive integer satisfying x0 = xm. Prove that m is divisible by n. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1996 China National Olympiad"
        }
      ]
    },
    {
      "year": 1994,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let ABCD be a trapezoid with AB $\\parallel$CD. Points E, F lie on segments AB, CD respectively. Segments CE, BF meet at H, and segments ED, AF meet at G. Show that SEHFG $\\leq$1 4SABCD. Determine, with proof, if the conclusion still holds when ABCD is just any convex quadrilat- eral."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "There are m pieces of candy held in n trays(n, m $\\geq$4). An operation is deﬁned as follow: take out one piece of candy from any two trays respectively, then put them in a third tray. Determine, with proof, if we can move all candies to a single tray by ﬁnite operations."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Find all functions f : [1, $\\infty$) $\\rightarrow$[1, $\\infty$) satisfying the following conditions: (1) f(x) $\\leq$2(x + 1); (2) f(x + 1) = 1 x[(f(x))2 −1] ."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Let f(z) = c0zn +c1zn−1 +c2zn−2 +$\\cdot$ $\\cdot$ $\\cdot$+cn−1z +cn be a polynomial with complex coefﬁcients. Prove that there exists a complex number z0 such that $|$f(z0)$|$ $\\geq$$|$c0$|$ + $|$cn$|$, where $|$z0$|$ $\\leq$1."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "For arbitrary natural number n, prove that Pn k=0 Ck n2kC[(n−k)/2] n−k = Cn 2n+1, where C0 0 = 1 and [n −k"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "] denotes the integer part of n −k"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let M be a point which has coordinates (p $\\times$ 1994, 7p $\\times$ 1994) in the Cartesian plane (p is a prime). Find the number of right-triangles satisfying the following conditions: (1) all vertexes of the triangle are lattice points, moreover M is on the right-angled corner of the triangle; (2) the origin (0, 0) is the incenter of the triangle. © 2020 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1995 China National Olympiad"
        }
      ]
    },
    {
      "year": 1993,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Given an odd n, prove that there exist 2n integers a1, a2, $\\cdot$ $\\cdot$ $\\cdot$ , an; b1, b2, $\\cdot$ $\\cdot$ $\\cdot$ , bn, such that for any integer k (0 < k < n), the following 3n integers: ai+ai+1, ai+bi, bi+bi+k (i = 1, 2, $\\cdot$ $\\cdot$ $\\cdot$ , n; an+1 = a1, bn+j = bj, 0 < j < n) are of different remainders on division by 3n."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given a natural number k and a real number a(a > 0), ﬁnd the maximal value of ak1 + ak2 + $\\cdot$ $\\cdot$ $\\cdot$ + akr, where k1 + k2 + $\\cdot$ $\\cdot$ $\\cdot$ + kr = k (ki $\\in$N, 1 $\\leq$r $\\leq$k)."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let K, K1 be two circles with the same center and their radii equal to R and R1(R1 > R) respec- tively. Quadrilateral ABCD is inscribed in circle K. Quadrilateral A1B1C1D1 is inscribed in cir- cle K1 where A1, B1, C1, D1 lie on rays CD, DA, AB, BC respectively. Show that SA1B1C1D1 SABCD $\\geq$ R2"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "R2 ."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "We are given a set S = {z1, z2, $\\cdot$ $\\cdot$ $\\cdot$ , z1993}, where z1, z2, $\\cdot$ $\\cdot$ $\\cdot$ , z1993 are nonzero complex numbers (also viewed as nonzero vectors in the plane). Prove that we can divide S into some groups such that the following conditions are satisﬁed: (1) Each element in S belongs and only belongs to one group; (2) For any group p, if we use T(p) to denote the sum of all memebers in p, then for any memeber zi(1 $\\leq$i $\\leq$1993) of p, the angle between zi and T(p) does not exceed 90◦; (3) For any two groups p and q, the angle between T(p) and T(q) exceeds 90◦(use the notation introduced in (2))."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "10 students bought some books in a bookstore. It is known that every student bought exactly three kinds of books, and any two of them shared at least one kind of book. Determine, with proof, how many students bought the most popular book at least? (Note: the most popular book means most students bought this kind of book)"
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let f : (0, +$\\infty$) $\\rightarrow$(0, +$\\infty$) be a function satisfying the following condition: for arbitrary pos- itive real numbers x and y, we have f(xy) $\\leq$f(x)f(y). Show that for arbitrary positive real number x and natural number n, inequality f(xn) $\\leq$f(x)f(x2)"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "2 . . . f(xn)"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "n holds. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1994 China National Olympiad"
        }
      ]
    },
    {
      "year": 1992,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let equation xn + an−1xn−1 + an−2xn−2 + $\\cdot$ $\\cdot$ $\\cdot$ + a1x + a0 = 0 with real coefﬁcients satisfy 0 < a0 $\\leq$a1 $\\leq$a2 $\\leq$$\\cdot$ $\\cdot$ $\\cdot$ $\\leq$an−1 $\\leq$1. Suppose that $\\lambda$ ($|$$\\lambda$$|$ > 1) is a complex root of the equation, prove that $\\lambda$n+1 = 1."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given nonnegative real numbers x1, x2, . . . , xn, let a = min{x1, x2, . . . , xn}. Prove that the fol- lowing inequality holds: n X i=1 1 + xi 1 + xi+1 $\\leq$n +"
        },
        {
          "day": 1,
          "number": 1,
          "problem": "(1 + a)2 n X i=1 (xi −a)2 (xn+1 = x1), and equality occurs if and only if x1 = x2 = $\\cdot$ $\\cdot$ $\\cdot$ = xn."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given a 9$\\times$9 grid, we assign either +1 or −1 to each square on the grid. We deﬁne an adjustment as follow: for each square on the grid, we make a product of all numbers of those squares which share a common side with the square (excluding itself).Then we have 81 products. Next we replace all the squares values with their corresponding products. Determine if we can make all values in the grid equal to 1 through ﬁnite adjustments."
        },
        {
          "day": 2,
          "number": 1,
          "problem": "A convex quadrilateral ABCD is inscribed in a circle with center O. The diagonals AC, BD of ABCD meet at P. Circumcircles of $\\triangle$ABP and $\\triangle$CDP meet at P and Q (O, P, Q are pairwise distinct). Show that $\\angle$OQP = 90◦."
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Find the maximum possible number of edges of a simple graph with 8 vertices and without any quadrilateral. (a simple graph is an undirected graph that has no loops (edges connected at both ends to the same vertex) and no more than one edge between any two different vertices.)"
        },
        {
          "day": 2,
          "number": 3,
          "problem": "Let sequence {a1, a2, . . . } with integer terms satisfy the following conditions: 1) an+1 = 3an −3an−1 + an−2, n = 2, 3, . . . ; 2) 2a1 = a0 + a2 −2 ; 3) for arbitrary natural number m, there exist m consecutive terms ak, ak−1, . . . , ak+m−1 among the sequence such that all such m terms are perfect squares. Prove that all terms of the sequence {a1, a2, . . . } are perfect squares. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1993 China National Olympiad"
        }
      ]
    },
    {
      "year": 1991,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "We are given a convex quadrilateral ABCD in the plane. (i) If there exists a point P in the plane such that the areas of $\\triangle$ABP, $\\triangle$BCP, $\\triangle$CDP, $\\triangle$DAP are equal, what condition must be satisﬁed by the quadrilateral ABCD? (ii) Find (with proof) the maximum possible number of such point P which satisﬁes the con- dition in (i)."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given I = [0, 1] and G = {(x, y)$|$x, y $\\in$I}, ﬁnd all functions f : G $\\rightarrow$I, such that $\\forall$x, y, z $\\in$I we have: i. f(f(x, y), z) = f(x, f(y, z)); ii. f(x, 1) = x, f(1, y) = y; iii. f(zx, zy) = zkf(x, y). (k is a positive real number irrelevant to x, y, z.)"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "There are 10 birds on the ground. For any 5 of them, there are at least 4 birds on a circle. Determine the least possible number of birds on the circle with the most birds."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Find all positive integer solutions (x, y, z, n) of equation x2n+1 −y2n+1 = xyz + 22n+1, where n $\\geq$2 and z $\\leq$5 $\\times$ 22n."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Find all natural numbers n, such that mink$\\in$N(k2 + [n/k2]) = 1991. ([n/k2] denotes the integer part of n/k2.)"
        },
        {
          "day": 2,
          "number": 6,
          "problem": "A football is covered by some polygonal pieces of leather which are sewed up by three different colors threads. It features as follows: i) any edge of a polygonal piece of leather is sewed up with an equal-length edge of another polygonal piece of leather by a certain color thread; ii) each node on the ball is vertex to exactly three polygons, and the three threads joint at the node are of different colors. Show that we can assign to each node on the ball a complex number (not equal to 1), such that the product of the numbers assigned to the vertices of any polygonal face is equal to 1. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1992 China National Olympiad"
        }
      ]
    },
    {
      "year": 1990,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Given a convex quadrilateral ABCD, side AB is not parallel to side CD. The circle O1 passing through A and B is tangent to side CD at P. The circle O2 passing through C and D is tangent to side AB at Q. Circle O1 and circle O2 meet at E and F. Prove that EF bisects segment PQ if and only if BC $\\parallel$AD."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let x be a natural number. We call {x0, x1, . . . , xl} a factor link of x if the sequence {x0, x1, . . . , xl} satisﬁes the following conditions: (1) x0 = 1, xl = x; (2) xi−1 < xi, xi−1$|$xi, i = 1, 2, . . . , l . Meanwhile, we deﬁne l as the length of the factor link {x0, x1, . . . , xl}. Denote by L(x) and R(x) the length and the number of the longest factor link of x respectively. For x = 5k $\\times$31m $\\times$1990n, where k, m, n are natural numbers, ﬁnd the value of L(x) and R(x)."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "A function f(x) deﬁned for x $\\geq$0 satisﬁes the following conditions: i. for x, y $\\geq$0, f(x)f(y) $\\leq$x2f(y/2) + y2f(x/2); ii. there exists a constant M(M > 0), such that $|$f(x)$|$ $\\leq$M when 0 $\\leq$x $\\leq$1. Prove that f(x) $\\leq$x2."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Given a positive integer number a and two real numbers A and B, ﬁnd a necessary and sufﬁ- cient condition on A and B for the following system of equations to have integer solution: ( x2 + y2 + z2 = (Ba)2 x2(Ax2 + By2) + y2(Ay2 + Bz2) + z2(Az2 + Bx2) = 1 4(2A + B)(Ba)4"
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Given a ﬁnite set X, let f be a rule such that f maps every even-element-subset E of X (i.e. E $\\subseteq$X, $|$E$|$ is even) into a real number f(E). Suppose that f satisﬁes the following conditions: (I) there exists an even-element-subset D of X such that f(D) > 1990; (II) for any two disjoint even-element-subsets A, B of X, equation f(A$\\cup$B) = f(A)+f(B)−1990 holds. Prove that there exist two subsets P, Q of X satisfying: (1) P $\\cap$Q = $\\emptyset$, P $\\cup$Q = X; © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 1990 China National Olympiad (2) for any non-even-element-subset S of P (i.e. S $\\subseteq$P, $|$S$|$ is odd), we have f(S) > 1990; (3) for any even-element-subset T of Q, we have f(T) $\\leq$1990."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "A convex n-gon and its n−3 diagonals which have no common point inside the polygon form a subdivision graph. Show that if and only if 3$|$n, there exists a subdivision graph that can be drawn in one closed stroke. (i.e. start from a certain vertex, get through every edges and diagonals exactly one time, ﬁnally back to the starting vertex.) © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1991 China National Olympiad"
        }
      ]
    },
    {
      "year": 1989,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "We are given two point sets A and B which are both composed of ﬁnite disjoint arcs on the unit circle. Moreover, the length of each arc in B is equal to $\\pi$ m (m $\\in$N). We denote by Aj the set obtained by a counterclockwise rotation of A about the center of the unit circle for j$\\pi$ m (j = 1, 2, 3, . . . ). Show that there exists a natural number k such that l(Ak $\\cap$B) $\\geq$1 2$\\pi$l(A)l(B).(Here l(X) denotes the sum of lengths of all disjoint arcs in the point set X)"
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Let x1, x2, . . . , xn (n $\\geq$2) be positive real numbers satisfying Pn i=1 xi = 1. Prove that: n X i=1 xi $\\sqrt{}$1 −xi $\\geq$ Pn i=1 $\\sqrt{}$xi $\\sqrt{}$n −1 ."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Let S be the unit circle in the complex plane (i.e. the set of all complex numbers with their moduli equal to 1). We deﬁne function f : S $\\rightarrow$S as follow: $\\forall$z $\\in$S, f(1)(z) = f(z), f(2)(z) = f(f(z)), . . . , f(k)(z) = f(f(k−1)(z))(k > 1, k $\\in$N), . . . We call c an n-period-point of f if c (c $\\in$S) and n (n $\\in$N) satisfy: f(1)(c) = c, f(2)(c) = c, f(3)(c) = c, . . . , f(n−1)(c) = c, f(n)(c) = c. Suppose that f(z) = zm (z $\\in$S; m > 1, m $\\in$N), ﬁnd the number of 1989-period-point of f."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Given a triangle ABC, points D, E, F lie on sides BC, CA, AB respectively. Moreover, the radii of incircles of $\\triangle$AEF, $\\triangle$BFD, $\\triangle$CDE are equal to r. Denote by r0 and R the radii of incircles of $\\triangle$DEF and $\\triangle$ABC respectively. Prove that r + r0 = R."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Given 1989 points in the space, any three of them are not collinear. We divide these points into 30 groups such that the numbers of points in these groups are different from each other. Consider those triangles whose vertices are points belong to three different groups among the 30. Determine the numbers of points of each group such that the number of such triangles attains a maximum. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 1989 China National Olympiad"
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Find all functions f : (1, +$\\infty$) $\\rightarrow$(1, +$\\infty$) that satisfy the following condition: for arbitrary x, y > 1 and u, v > 0, inequality f(xuyv) $\\leq$f(x)"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "4u f(y)"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "4v holds. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1990 China National Olympiad"
        }
      ]
    },
    {
      "year": 1988,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let r1, r2, . . . , rn be real numbers. Given n reals a1, a2, . . . , an that are not all equal to 0, suppose that inequality r1(x1 −a1) + r2(x2 −a2) + $\\cdot$ $\\cdot$ $\\cdot$ + rn(xn −an) $\\leq$ q x2 1 + x2 2 + $\\cdot$ $\\cdot$ $\\cdot$ + x2n − q a2 1 + a2 2 + $\\cdot$ $\\cdot$ $\\cdot$ + a2n holds for arbitrary reals x1, x2, . . . , xn. Find the values of r1, r2, . . . , rn."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "Given two circles C1, C2 with common center, the radius of C2 is twice the radius of C1. Quadri- lateral A1A2A3A4 is inscribed in C1. The extension of A4A1 meets C2 at B1; the extension of A1A2 meets C2 at B2; the extension of A2A3 meets C2 at B3; the extension of A3A4 meets C2 at B4. Prove that P(B1B2B3B4) $\\geq$2P(A1A2A3A4), and in what case the equality holds? (P(X) denotes the perimeter of quadrilateral X)"
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Given a ﬁnite sequence of real numbers a1, a2, . . . , an (∗), we call a segment ak, . . . , ak+l−1 of the sequence (∗) a long(Chinese dragon) and ak head of the long if the arithmetic mean of ak, . . . , ak+l−1 is greater than 1988. (especially if a single item am > 1988, we still regard am as a long). Suppose that there is at least one long among the sequence (∗), show that the arithmetic mean of all those items of sequence (∗) that could be head of a certain long individually is greater than 1988."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "(1) Let a, b, c be positive real numbers satisfying (a2 + b2 + c2)2 > 2(a4 + b4 + c4). Prove that a, b, c can be the lengths of three sides of a triangle respectively. (2) Let a1, a2, . . . , an be n (n > 3) positive real numbers satisfying (a2 1 + a2 2 + $\\cdot$ $\\cdot$ $\\cdot$ + a2 n)2 > (n −1)(a4 1 + a4 2 + $\\cdot$ $\\cdot$ $\\cdot$ + a4 n). Prove that any three of a1, a2, . . . , an can be the lengths of three sides of a triangle respectively."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Given three tetrahedrons AiBiCiDi (i = 1, 2, 3), planes $\\alpha$i, $\\beta$i, $\\gamma$i (i = 1, 2, 3) are drawn through Bi, Ci, Di respectively, and they are perpendicular to edges AiBi, AiCi, AiDi (i = 1, 2, 3) re- spectively. Suppose that all nine planes $\\alpha$i, $\\beta$i, $\\gamma$i (i = 1, 2, 3) meet at a point E, and points A1, A2, A3 lie on line l. Determine the intersection (shape and position) of the circumscribed spheres of the three tetrahedrons."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Let n (n $\\geq$3) be a natural number. Denote by f(n) the least natural number by which n is not divisible (e.g. f(12) = 5). If f(n) $\\geq$3, we may have f(f(n)) in the same way. Similarly, if © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 1988 China National Olympiad f(f(n)) $\\geq$3, we may have f(f(f(n))), and so on. If f(f(. . . f $|$ {z } k times (n) . . . )) = 2, we call k the length of n (also we denote by ln the length of n). For arbitrary natural number n (n $\\geq$3), ﬁnd ln with proof. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1989 China National Olympiad"
        }
      ]
    },
    {
      "year": 1987,
      "problems": [
        {
          "day": 1,
          "number": 1,
          "problem": "Let n be a natural number. Prove that a necessary and sufﬁcient condition for the equation zn+1 −zn −1 = 0 to have a complex root whose modulus is equal to 1 is that n + 2 is divisible by 6."
        },
        {
          "day": 1,
          "number": 2,
          "problem": "We are given an equilateral triangle ABC with the length of its side equal to 1. There are n −1 points on each side of the triangle ABC that equally divide the side into n segments. We draw all possible lines that pass through any two of all those 3(n −1) points such that they are parallel to one of three sides of triangle ABC. All such lines divide triangle ABC into some lesser triangles whose vertices are called nodes. We assign a real number for each node such that the following conditions are satisﬁed: (I) real numbers a, b, c are assigned to A, B, C respectively; (II) for any rhombus that is consisted of two lesser triangles that share a common side, the sum of the numbers of vertices on its one diagonal is equal to that of vertices on the other diagonal. 1) Find the minimum distance between the node with the maximal number to the node with the minimal number; 2) Denote by S the sum of the numbers of all nodes, ﬁnd S."
        },
        {
          "day": 1,
          "number": 3,
          "problem": "Some players participate in a competition. Suppose that each player plays one game against every other player and there is no draw game in the competition. Player A is regarded as an excellent player if the following condition is satisﬁed: for any other player B, either A beats B or there exists another player C such that C beats B and A beats C. It is known that there is only one excellent player in the end, prove that this player beats all other players."
        },
        {
          "day": 2,
          "number": 4,
          "problem": "Five points are arbitrarily put inside a given equilateral triangle ABC whose area is equal to 1. Show that we can draw three equilateral triangles within triangle ABC such that the following conditions are all satisﬁed: i) the ﬁve points are covered by the three equilateral triangles; ii) any side of the three equilateral triangles is parallel to a certain side of the triangle ABC; iii) the sum of the areas of the three equilateral triangles is not larger than 0.64."
        },
        {
          "day": 2,
          "number": 5,
          "problem": "Let A1A2A3A4 be a tetrahedron. We construct four mutually tangent spheres S1, S2, S3, S4 with centers A1, A2, A3, A4 respectively. Suppose that there exists a point Q such that we can con- © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 1,
          "problem": "AoPS Community 1987 China National Olympiad struct two spheres centered at Q satisfying the following conditions: i) One sphere with radius r is tangent to S1, S2, S3, S4; ii) One sphere with radius R is tangent to every edges of tetrahedron A1A2A3A4. Prove that A1A2A3A4 is a regular tetrahedron."
        },
        {
          "day": 2,
          "number": 6,
          "problem": "Sum of m pairwise different positive even numbers and n pairwise different positive odd num- bers is equal to 1987. Find, with proof, the maximum value of 3m + 4n. © 2019 AoPS Incorporated"
        },
        {
          "day": 2,
          "number": 2,
          "problem": "Art of Problem Solving is an ACS WASC Accredited School. AoPS Community 1988 China National Olympiad"
        }
      ]
    }
  ]
}
